Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: wxLog does however guarantee that messages logged by each thread will appear in order in which they were logged.
ja: ただし、wxLog は各スレッドで記録されたメッセージは記録された順に表示されることを保証しています。

source: wxOutputStream does the same thing for write-only streams.
ja: wxOutputStream も同じことを行いますが、こちらは書き込み専用のストリーム用です。

source: Event handling overview
ja: イベント処理の概要

source: Interprocess communication
ja: プロセス間通信

source: wxString overview
ja: wxString の概要

source: Window styles
ja: ウィンドウスタイル

source: Window deletion overview
ja: ウィンドウ削除の概要

source: wxEXPAND | // make horizontally stretchable
ja: wxEXPAND | // 水平方向にリサイズ可能にし、

source: wxALL, // and make border all around
ja: wxALL, // 全方向にボーダーを持たせる

source: Background: The wxString class
ja: 背景: wxString クラス

source: Bitmap format handlers
ja: ビットマップ形式ハンドラ

source: Bitmaps and icons
ja: ビットマップとアイコン

source: Comparison of wxString to other string classes
ja: wxString と他の文字列クラスとの比較

source: Examples
ja: 例

source: How events are processed
ja: イベント処理の仕組み

source: Programming with wxBoxSizer
ja: wxBoxSizer を用いたプログラミング

source: Unicode and ANSI modes
ja: Unicode モードと ANSI モード

source: Unicode support in wxWidgets
ja: wxWidgets における Unicode 対応

source: wxMBConv classes overview
ja: wxMBConv クラスの概要

source: wxALL, // make border all around (implicit top alignment)
ja: wxALL, // 全方向にボーダーを持たせる (暗黙的に上寄せになる)

source: File classes and functions overview
ja: ファイルクラスと関数の概要

source: Events generated by the user vs programmatically generated events
ja: ユーザの生成したイベントとプログラム的に生成したイベント

source: More DDE details
ja: DDE の詳細

source: Programming with wxGridSizer
ja: wxGridSizer を用いたプログラミング

source: Some advice about using wxString
ja: wxStringを使用するにあたってのアドバイス

source: Window sizing
ja: ウインドウのサイズ

source: wxMBConv classes
ja: wxMBConv クラス

source: wxString will therefore inherit the performance characteristics from std::string.
ja: したがって、wxString はその性能上の特徴を std::string から引き継ぐことになります。

source: wxStreams overview
ja: wxStreams の概要

source: wxLog classes overview
ja: wxLog クラスの概要

source: wxALIGN_CENTER ); // no border and centre horizontally
ja: wxALIGN_CENTER ); // ボーダーなしで水平方向に中央寄せ

source: wxLog::DoLogTextAtLevel() should be overridden if you simply want to redirect the log messages somewhere else, without changing their formatting.
ja: メッセージの形式を変更することなく、ログメッセージを単純に他の場所へリダイレクトしたいだけの場合、wxLog::DoLogTextAtLevel() をオーバーライドします。

source: wxConfig classes overview
ja: wxConfig クラスの概要

source: Application class: wxApp
ja: アプリケーションクラス: wxApp

source: Other string related functions and classes
ja: 文字列に関する他の関数やクラス

source: Pluggable event handlers
ja: 動的イベントハンドラ

source: Programming with wxFlexGridSizer
ja: wxFlexGridSizer を用いたプログラミング

source: Unicode and the outside world
ja: Unicode と外部の世界

source: wxMBConv objects
ja: wxMBConv オブジェクト

source: wxDialog overview
ja: wxDialog の概要

source: wxValidator overview
ja: wxValidator の概要

source: Sizer overview
ja: サイザーの概要

source: Dialogs
ja: ダイアログ

source: File classes and functions
ja: ファイルクラスと関数

source: Programming with wxStaticBoxSizer
ja: wxStaticBoxSizer を用いたプログラミング

source: Reference counting and why you shouldn't care about it
ja: 参照カウンタと、それを意識しなくて良い理由

source: Unicode-related compilation settings
ja: Unicode 関連のコンパイル設定

source: Window identifiers
ja: ウィンドウ識別子

source: Bitmaps and icons overview
ja: ビットマップとアイコンの概要

source: Device context overview
ja: デバイスコンテキストの概要

source: "Best Client Size": this is simply the client size corresponding to the best window size.
ja: "最適クライアントサイズ": これは単に最適ウィンドウサイズのクライアントサイズ版です。

source: "Best Size": the best size of a widget depends on what kind of widget it is, and usually also on the contents of the widget.
ja: "最適サイズ": ウィジェットの最適サイズはウィジェットの種類と、通常はウィジェットの内容物に依存します。

source: "Client Size": the client size represents the widget's area inside of any borders belonging to the widget and is the area that can be drawn upon in a EVT_PAINT event.
ja: "クライアントサイズ": クライアントサイズはボーダーの内側の領域を表しており、この領域は EVT_PAINT イベントで描画できます。

source: "Initial Size": the initial size of a widget is the size given to the constructor of the widget, if any.
ja: "初期サイズ": ウィジェットの初期サイズはウィジェットのコンストラクタで指定されたサイズのことです。

source: "Maximum Size": just like for the minimal size, the maximum size is normally explicitly set by the programmer with the wxWindow::SetMaxSize() method or with wxWindow::SetSizeHints().
ja: "最大サイズ": 最小サイズと同じように、最大サイズは通常、プログラマが wxWindow::SetMaxSize() 関数か wxWindow::SetSizeHints() 関数のどちらかを使用して明示的に設定します。

source: "Minimal Size": the minimal size of a widget is a size that is normally explicitly set by the programmer either with the wxWindow::SetMinSize() method or with the wxWindow::SetSizeHints() method.
ja: "最小サイズ": ウィジェットの最小サイズは通常、プログラマが wxWindow::SetMinSize() 関数か wxWindow::SetSizeHints() 関数のどちらかを使用して明示的に設定するサイズです。

source: "Size": this is the current size of the window and it can be explicitly set or fetched with the wxWindow::SetSize() or wxWindow::GetSize() methods.
ja: "サイズ": これはウィンドウの現在のサイズで、SetSize() 関数や GetSize() 関数で明示的に設定・取得することができます。

source: "Virtual Size": the virtual size is the size of the potentially viewable area of the widget.
ja: "仮想サイズ": 仮想サイズはウィジェットで潜在的に表示可能な領域のサイズのことです。

source: wxString is Unicode friendly: it allows to easily convert to and from ANSI and Unicode strings (see Unicode Support in wxWidgets for more details) and maps to std::wstring transparently.
ja: Unicode との親和性: wxString は簡単に ANSI 文字列や Unicode 文字列と相互に変換できます (詳細は wxWidgets における Unicode 対応 を参照してください) し、透過的に std::wstring へマッピングされます。

source: A border: The border is just empty space and is used to separate dialog items in a dialog.
ja: ボーダー : ボーダーは単なる空白スペースで、ダイアログ内でコントロール同士を分けるために使用します。

source: A minimal size: This minimal size is usually identical to the initial size of the controls and may either be set explicitly in the wxSize field of the control constructor or may be calculated by wxWidgets, typically by setting the height and/or the width of the item to -1.
ja: 最小サイズ : 通常、この最小サイズはコントロールの初期サイズと同じであり、コントロールのコンストラクタの wxSize フィールドに明示的に設定されるか、(普通は高さや幅に -1 を設定することで) wxWidgets によって計算されます。

source: A stretch factor: If a sizer contains more than one child and it is offered more space than its children and their borders need, the question arises how to distribute the surplus space among the children.
ja: ストレッチ係数 : サイザーがひとつ以上の子コントロールを持ち、子コントロールとそのボーダーの必要とするサイズ以上のサイズを持つ場合、余剰スペースを子コントロールに対してどのように分配するかが問題となります。

source: Advise: The client asks to be advised of any change in data associated with a particular item.
ja: Advise: 特定の項目に関連するデータの変更をクライアントへ通知するように要求します。

source: An alignment: Often, a dialog item is given more space than its minimal size plus its border.
ja: アライメント : ダイアログアイテムに対して、最小サイズとボーダーのスペースよりも多くのスペースを与えることはよくあります。

source: BestSize: The best size of a widget depends on what kind of widget it is, and usually also on the contents of the widget.
ja: 最適サイズ: ウィジェットの最適サイズはウィジェットの種類と、通常はウィジェットの内容物に依存します。

source: ClientSize: The client size represents the widget's area inside of any borders belonging to the widget and is the area that can be drawn upon in a EVT_PAINT event.
ja: クライアントサイズ: クライアントサイズはボーダーの内側の領域を表しており、この領域は EVT_PAINT イベントで描画できます。

source: Compatibility: This class tries to combine almost full compatibility with the old wxWidgets 1.xx wxString class, some reminiscence of MFC's CString class and 90% of the functionality of std::string class.
ja: 互換性 このクラスは wxWidgets 1.xx の wxString クラス、および昔懐かしい MFC の CString クラスとほぼ完全に互換性があり、std::string クラスの機能の 90% と互換性があります。

source: Compatibility This class tries to combine almost full compatibility with the old wxWidgets 1.xx wxString class, some reminiscence to MFC CString class and 90% of the functionality of std::string class.
ja: 互換性 このクラスは wxWidgets 1.xx の wxString クラス、および昔懐かしい MFC の CString クラスとほぼ完全に互換性があり、std::string クラスの機能の 90% と互換性があります。

source: Completeness: Usually, an error message should be presented to the user when some operation fails.
ja: 完全性 : 通常、処理が失敗した場合にはエラーメッセージが表示されるべきです。

source: Completeness Usually, an error message should be presented to the user when some operation fails.
ja: 完全性 通常、処理が失敗した場合にはエラーメッセージが表示されるべきです。

source: Drag start: To start the dragging process (typically in response to a mouse click) you must call wxDropSource::DoDragDrop like this:
ja: ドラッグの開始 : (一般的にはマウスクリックに応じて) ドラッグ処理を開始するには、このように wxDropSource::DoDragDrop を呼び出す必要があります:

source: Dragging: The call to DoDragDrop() blocks the program until the user releases the mouse button (unless you override the GiveFeedback function to do something special).
ja: ドラッグ: (GiveFeedback 関数をオーバーライドして特別なことをさせない限り) DoDragDrop() を呼び出すと、ユーザがマウスのボタンを放すまでプログラムがブロックされます。

source: Dragging: The call to DoDragDrop() blocks the program until the user releases the mouse button (unless you override the wxDropSource::GiveFeedback function to do something special).
ja: ドラッグ: (GiveFeedback 関数をオーバーライドして特別なことをさせない限り) DoDragDrop() を呼び出すと、ユーザがマウスのボタンを放すまでプログラムがブロックされます。

source: Drop: When the user releases the mouse over a window, wxWidgets asks the associated wxDropTarget object if it accepts the data.
ja: ドロップ : ユーザがウィンドウ上でマウスを放すと、wxWidgets は関連付けられた wxDropTarget オブジェクトへ、そのデータを受け付けるか問い合わせます。

source: Efficiency: Since wxWidgets 3.0 wxString uses std::string (in UTF8 mode under Linux, Unix and OS X) or std::wstring (in UTF16 mode under Windows) internally by default to store its contents.
ja: 効率性: wxWidgets 3.0 の wxString ではデフォルトで std::string (Linux、Unix、OS X の UTF8 モード時) または std::wstring (Windows の UTF16 モード時) を内部的に使用します。

source: Efficiency This class was made to be as efficient as possible: both in terms of size (each wxString objects takes exactly the same space as a char * pointer, sing reference counting) and speed.
ja: 効率性 このクラスはできるだけ効率的に動作するように作られています: これはサイズ (個々の wxString オブジェクトは 参照カウンタ のおかげで char * ポインタと完全に同じサイズです) と性能面の両方についてです。

source: Execute: the client calls the server with a data string representing a command to be executed.
ja: Execute: 実行するコマンドを表すデータ文字列を指定してクライアントからサーバを呼び出します。

source: Flexibility: The output of wxLog functions can be redirected or suppressed entirely based on their importance, which is either impossible or difficult to do with traditional methods.
ja: 柔軟性 : wxLog 関数の出力はその重要度に応じてリダイレクトしたり抑制したりできます。これは従来の関数では不可能、もしくは困難なことです。

source: Flexibility The output of wxLog functions can be redirected or suppressed entirely based on their importance, which is either impossible or difficult to do with traditional methods.
ja: 柔軟性 wxLog 関数の出力はその重要度に応じてリダイレクトしたり抑制したりできます。これは従来の関数では不可能、もしくは困難なことです。

source: GetEffectiveMinSize(): (formerly GetBestFittingSize) A blending of the widget's min size and best size, giving precedence to the min size.
ja: GetEffectiveMinSize(): (以前は GetBestFittingSize でした) ウィジェットの最小サイズと最適サイズを混ぜあわせたもので、最小サイズよりも優先されます。

source: InitialSize: The initial size of a widget is the size given to the constructor of the widget, if any.
ja: 初期サイズ: ウィジェットの初期サイズはウィジェットのコンストラクタで指定されたサイズのことです。

source: Initialization: For a window to be a drop target, it needs to have an associated wxDropTarget object.
ja: 初期化 : ウィンドウをドロップ先にするには、ウィンドウを wxDropTarget オブジェクトへ関連付ける必要があります。

source: MinSize: The min size of a widget is a size that is normally explicitly set by the programmer either with the SetMinSize() method or the SetSizeHints() method.
ja: 最小サイズ: ウィジェットの最小サイズは通常、プログラマが SetMinSize() 関数か SetSizeHints() 関数のどちらかを使用して明示的に設定するサイズです。

source: Note: bitmap handlers are not implemented on all platforms, and new ones rarely need to be implemented since wxImage can be used for loading most formats, as noted earlier.
ja: 注: ビットマップハンドラはすべてのプラットフォームで実装されているわけでありませんし、新しいものを実装する必要もほとんどないでしょう。なぜなら、前で述べたように wxImage を使用することで大半の形式を読み込むことができるためです。

source: Note: this section is strictly about performance issues and is absolutely not necessary to read for using wxString class.
ja: 注: この章では性能に関する問題のみを取り扱っており、wxString クラスを使用するだけであれば読む必要はまったくありません。

source: Pay close attention to Step 5. People often overlook or get confused by this powerful feature of the wxWidgets event processing system.
ja: ステップ 5 に注意してください。 wxWidgets のイベント処理システムの持つこの強力な機能はしばしば見落とされたり、人を混乱させたりします。

source: Poke: The client sends a data string associated with an item string directly to the server.
ja: Poke: ある項目に関連するデータ文字列をクライアントからサーバへ直接送信します。

source: Portability: It is a common practice to use printf() statements or cout/cerr C++ streams for writing out some (debug or otherwise) information.
ja: 移植性 : デバッグ情報や他の情報の出力に printf() や cout/cerr などの C++ ストリームを使用するのはごく普通のことです。

source: Portability It is a common practice to use printf() statements or cout/cerr C++ streams for writing out some (debug or otherwise) information.
ja: 移植性 デバッグ情報や他の情報の出力に printf() や cout/cerr などの C++ ストリームを使用するのはごく普通のことです。

source: Preparation: First of all, a data object must be created and initialized with the data you wish to drag.
ja: 準備: まず最初に、データオブジェクトを作成し、ドラッグしたいデータで初期化する必要があります。

source: Processing the result: DoDragDrop() returns an effect code which is one of the values of wxDragResult enum (explained here):
ja: 結果の処理 : DoDragDrop() は wxDragResult 列挙型のいずれかの値を 影響コード (effect code) として返却します:

source: Processing the result: DoDragDrop() returns an effect code which is one of the values of wxDragResult enum (explained in wxDropTarget page):
ja: 結果の処理 : DoDragDrop() は (wxDropTarget で説明している) wxDragResult 列挙型のいずれかの値を 影響コード (effect code) として返却します:

source: Request: the client asks the server for a particular data string associated with a given item string.
ja: Request: 指定した項目に関連する特定のデータ文字列をクライアントからサーバへ要求します。

source: Rich set of functions: Some of the functions present in wxString are very useful but don't exist in most of other string classes: for example, wxString::AfterFirst, wxString::BeforeLast, wxString::Printf.
ja: 豊富な関数群 wxString に存在するいくつかの関数はとても便利ですが、他の文字列クラスの大半には存在しません: 例えば、AfterFirst、BeforeLast、Printf などです。

source: Rich set of functions Some of the functions present in wxString are very useful but don't exist in most of other string classes: for example, AfterFirst, BeforeLast, operator<< or Printf.
ja: 豊富な関数群 wxString に存在するいくつかの関数はとても便利ですが、他の文字列クラスの大半には存在しません: 例えば、AfterFirst、BeforeLast、operator<<、Printf などです。

source: SECURITY NOTE: Using Internet domain sockets is extremely insecure for IPC as there is absolutely no access control for them, use Unix domain sockets whenever possible!
ja: セキュリティ上の注意: インターネットドメインソケットを使用したプロセス間通信は非常に危険です。なぜなら、これらの通信に対するアクセス制御はまったく行われないためです。可能な限り、Unix ドメインソケットを使用してください。

source: SearchEventTable is called for this event handler.
ja: このイベントハンドラから SearchEventTable が呼ばれます。

source: SetInitialSize(size): (formerly SetBestFittingSize) This is a little different than the typical size setters.
ja: SetInitialSize(size): (以前は SetBestFittingSize でした) これは通常のサイズ設定関数とは少しだけ異なります。

source: Size: The size of a widget can be explicitly set or fetched with the SetSize() or GetSize() methods.
ja: サイズ: ウィジェットのサイズは SetSize() 関数や GetSize() 関数で明示的に設定・取得することができます。

source: The end: After processing the data, DoDragDrop() returns either wxDragCopy or wxDragMove depending on the state of the keys <Ctrl>, <Shift> and <Alt> at the moment of the drop.
ja: 終了 : ドロップ時の <Ctrl>、<Shift>、<Alt> キーの状態に応じて、データ処理のあとに DoDragDrop() は wxDragCopy または wxDragMove のいずれの値かを返却します。

source: The end: After processing the data, DoDragDrop() returns either wxDragCopy or wxDragMove depending on the state of the keys Ctrl, Shift and Alt at the moment of the drop.
ja: 終了 : ドロップ時の Ctrl、Shift、Alt キーの状態に応じて、データ処理のあとに DoDragDrop() は wxDragCopy または wxDragMove のいずれの値かを返却します。

source: The usage of std::string compatible functions is strongly advised! It will both make your code more familiar to other C++ programmers (who are supposed to have knowledge of std::string but not of wxString), let you reuse the same code in both wxWidgets and other programs (by just typedefing wxString as std::string when used outside wxWidgets) and by staying compatible with future versions of wxWidgets which will probably start using std::string sooner or later too.
ja: std::string 互換の関数を使用することを強く推奨します! そうすることで、(std::string に関する知識はあっても wxString のことは知らないであろう) 他の C++ プログラマにとってより馴染みのあるコードにできますし、(wxWidgets 外でコードを使用するときは wxString を std::string として typedef することで) wxWidgets とそれ以外のプログラムで同じコードを再利用することもできます。また、wxWidgets の将来のバージョンとの互換性も保てます。なぜなら、遅かれ早かれ、おそらく wxWidgets で std::string を使用し始めるためです。

source: Unicode wxString is Unicode friendly: it allows to easily convert to and from ANSI and Unicode strings in any build mode (see the Unicode overview for more details) and maps to either string or wstring transparently depending on the current mode.
ja: ユニコード wxString は Unicode との親和性が高いです: どのビルドモードでも簡単に ANSI 文字列や Unicode 文字列と相互に変換できます (詳細は Unicode の概要 を参照してください) し、現在のビルドモードに応じて透過的に string か wstring のいずれかにマッピングされます。

source: Used by wxWidgets: And, of course, this class is used everywhere inside wxWidgets so there is no performance loss which would result from conversions of objects of any other string class (including std::string) to wxString internally by wxWidgets.
ja: wxWidgets での使用 もちろん、このクラスは wxWidgets 内部のあらゆるところで使用されています。そのため、wxWidgets が内部的に (std::string を含む) 他の文字列クラスを wxString へ変換することによる性能劣化が発生しません。

source: Used by wxWidgets And, of course, this class is used everywhere inside wxWidgets so there is no performance loss which would result from conversions of objects of any other string class (including std::string) to wxString internally by wxWidgets.
ja: wxWidgets での使用 もちろん、このクラスは wxWidgets 内部のあらゆるところで使用されています。そのため、wxWidgets が内部的に (std::string を含む) 他の文字列クラスを wxString へ変換することによる性能劣化が発生しません。

source: Warning: gettext versions < 0.10 are known to be buggy, so you should find a later version of it!
ja: 注意: gettext バージョン < 0.10 はバグが多いため、最新版を利用するべきです!

source: sizer.Fit(window): This sets the size of the window to be large enough to accommodate the minimum size needed by the sizer, (along with a few other constraints...) If the sizer is the one that is assigned to the window then this should be equivalent to window.Fit().
ja: sizer.Fit(window): これは (他のいくつかの制約とあわせて) サイザーの要求する最小サイズを充分満たすようにウィンドウサイズを設定します。ウィンドウに割り当てられているサイザーがひとつだけの場合は window.Fit() と等価になります。

source: sizer.Layout(): Recalculates the minimum space needed by each item in the sizer, and then lays out the items within the space currently allotted to the sizer.
ja: sizer.Layout(): サイザー内の各要素が必要とする最小サイズを再計算し、現在サイザーに割り当てられているスペース内に各要素を配置します。

source: window.Fit(): The Fit() method sets the size of a window to fit around its children.
ja: window.Fit(): Fit() 関数は子コントロールにフィットするようにウィンドウのサイズを設定します。

source: window.Layout(): If the window has a sizer then it sets the space given to the sizer to the current size of the window, which results in a call to sizer.Layout().
ja: window.Layout(): ウィンドウがサイザーを持つ場合に、現在のウィンドウサイズにあわせてサイザーが利用可能なスペースを設定します。これにより sizer.Layout() が呼び出されます。

source: wxClientDC. Use this to paint on the client area of window (the part without borders and other decorations), but do not use it from within an wxPaintEvent.
ja: wxClientDC。ウィンドウのクライアントエリア (ボーダーや他の装飾を除いた部分) に描画するときに使用します。ただし、wxPaintEvent の中で使用しないでください。

source: wxLogDebug is the right function for debug output.
ja: wxLogDebug は まさに デバッグ出力に適切な関数です。

source: wxLogError is the function to use for error messages, i.e. the messages that must be shown to the user.
ja: wxLogError はエラーメッセージ (ユーザに通知しなければならないメッセージ) 用の関数です。

source: wxLogFatalError which is like wxLogError, but also terminates the program with the exit code 3 (using abort() standard function).
ja: wxLogFatalError は wxLogError と似ていますが、(abort() 標準関数を使用して) リターンコード 3 でプログラムを終了させます。

source: wxLogGui This is the standard log target for wxWidgets applications (it is used by default if you don't do anything) and provides the most reasonable handling of all types of messages for given platform.
ja: wxLogGui これは wxWidgets アプリケーションの標準ログターゲット (何もしない場合にデフォルトで使用されます) で、指定されたプラットフォームについて、メッセージのすべての型に対してもっとも合理的な処理を行います。

source: wxLogMessage is for all normal, informational messages.
ja: wxLogMessage はすべての通常 (通知) メッセージ用の関数です。

source: wxLogNull The last log class is quite particular: it doesn't do anything.
ja: wxLogNull 最後のログクラスは極めて特殊です: これは何も行いません。

source: wxLogStatus is for status messages - they will go into the status bar of the active or specified (as the first argument) wxFrame if it has one.
ja: wxLogStatus はステータスメッセージ用の関数で、このメッセージはアクティブまたは第一引数で指定された wxFrame がステータスバーを持つ場合に、ステータスバーへ出力されます。

source: wxLogStderr This class logs messages to a FILE *, using stderr by default as its name suggests.
ja: wxLogStderr このクラスはメッセージを FILE * へ出力します。その名の通り、デフォルトでは stderr へ出力します。

source: wxLogStream This class has the same functionality as wxLogStderr, but uses ostream and cerr instead of FILE * and stderr.
ja: wxLogStream このクラスは wxLogStderr と同じ機能を持ちますが、FILE * と stderr の代わりに ostream と cerr を使用します。

source: wxLogSysError is mostly used by wxWidgets itself, but might be handy for logging errors after system call (API function) failure.
ja: wxLogSysError は主に wxWidgets 自身で使用されますが、システムコール (API 関数) の失敗後のエラーログを記録するのに便利かもしれません。

source: wxLogTrace as wxLogDebug only does something in debug build.
ja: wxLogTrace も wxLogDebug と同じようにデバッグビルド時のみ動作します。

source: wxLogVerbose is for verbose output.
ja: wxLogVerbose は詳細な出力用の関数です。

source: wxLogWarning for warnings - they are also normally shown to the user, but don't interrupt the program work.
ja: wxLogWarning は警告メッセージ (通常はユーザに通知されますが、プログラムの動作を妨げないメッセージ） 用の関数です。

source: wxLogWindow This log target provides a "log console" which collects all messages generated by the application and also passes them to the previous active log target.
ja: wxLogWindow このログターゲットはアプリケーションの生成するすべてのメッセージを収集する "ログコンソール" を提供するとともに、前に有効だったログターゲットに収集したメッセージを引き渡します。

source: wxPaintDC. Use this to paint on the client area of a window, but only from within a wxPaintEvent.
ja: wxPaintDC。ウィンドウのクライアントエリアに描画するときに使用しますが、wxPaintEvent の中で のみ 使用してください。

source: wxScreenDC. Use this to paint on the screen, as opposed to an individual window.
ja: wxScreenDC。個別のウィンドウではなく、スクリーン上に描画するときに使用します。

source: wxWindowDC. Use this to paint on the whole area of a window, including decorations.
ja: wxWindowDC。装飾を含む、ウィンドウ全体に描画するときに使用します。

source: Tip: under Windows, you must either run the program under debugger or use a 3rd party program such as DbgView to actually see the debug output.
ja: ヒント: Windows でデバッグ出力を確認するためにはデバッガーを使用するか、DbgView のようなサードパーティーのプログラムを使用する必要があります。

source: wxUSE_UNICODE is defined as 1 now to indicate Unicode support.
ja: Unicode に対応しているため、現在、 wxUSE_UNICODE は 1 として定義されています。

source: wxUSE_UNICODE is now defined as 1 by default to indicate Unicode support.
ja: Unicode に対応していることを表すため、現在ではデフォルトで wxUSE_UNICODE が 1 に定義されています。

source: Event class carried by the event: each event has some information associated with it and this data is represented by an object of a class derived from wxEvent.
ja: イベントクラス : 各イベントは自分自身に関連する情報を持っており、これは wxEvent の継承クラスで表現されます。

source: Event source: wxEvent stores the object which generated the event and, for windows, its identifier (see Window Identifiers).
ja: イベント発生元 : wxEvent はイベントを生成したオブジェクトや、生成元がウィンドウの場合はその識別子 (ウィンドウ識別子 参照) を格納しています。

source: Event type: this is simply a value of type wxEventType which uniquely identifies the type of the event.
ja: イベント型 : イベントの型を一意に識別するための wxEventType 型の値です。

source: OnInit will usually create a top window as a bare minimum.
ja: 通常、OnInit では最低限、トップウィンドウを作成します。

source: Please pay close attention to step 6! People often overlook or get confused by this powerful feature of the wxWidgets event processing system.
ja: ステップ 6 に注意してください。 wxWidgets のイベント処理システムの持つこの強力な機能はしばしば見落とされたり、人を混乱させたりします。

source: orient may be either of wxVERTICAL or wxHORIZONTAL for creating either a column sizer or a row sizer.
ja: 列サイザー、行サイザーを作成する場合、 orient はそれぞれ wxVERTICAL または wxHORIZONTAL になります。
